<!DOCTYPE html>
<html lang="es">
  <head>
    <title>Carlos Minutti - Investigador y Cient&iacute;fico de Datos</title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Carlos Minutti - Investigador y Cient&iacute;fico de Datos especializado en IA. Doctor en Ciencias de la Computaci&oacute;n por la UNAM.">
    <link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Roboto:wght@300;400;500;700&display=swap">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
    <link rel="stylesheet" href="../files/style.css">
  </head>
<body>

<!-- Language Switcher -->
<div class="lang-switch">
  <strong>ES</strong><span class="separator">|</span><a href="../">EN</a>
</div>

<!-- Page Container -->
<div class="w3-content w3-margin-top" style="max-width:1400px;">

  <!-- The Grid -->
  <div class="w3-row-padding">

    <!-- Left Column -->
    <div class="w3-third">

      <div class="profile-card">
        <div class="profile-photo-wrapper">
          <img src="../files/profile.jpg" alt="Foto de perfil de Carlos Minutti">
          <div class="profile-name-overlay">
            <h2>Carlos Minutti</h2>
          </div>
        </div>
        <div class="profile-info">
          <p><i class="fa fa-briefcase fa-fw"></i>Investigador / Cient&iacute;fico de Datos</p>
          <p><i class="fa fa-envelope fa-fw"></i>cminutti@data-fusionlab.com</p>
          <p><i class="fa fa-graduation-cap fa-fw"></i><a href="https://scholar.google.com/citations?user=wPweiiEAAAAJ">Google Scholar</a></p>
          <p><i class="fa fa-linkedin fa-fw"></i><a href="https://www.linkedin.com/in/carlos-minutti/">LinkedIn</a></p>
          <p><i class="fa fa-github fa-fw"></i><a href="https://github.com/cminuttim">GitHub</a></p>
          <p><i class="fa fa-globe fa-fw"></i><a href="https://data-fusionlab.com">Consultor&iacute;a</a></p>
          <p><i class="fa fa-stethoscope fa-fw"></i><a href="https://cminuttim.github.io/PumaMedNet-CXR/">PumaMedNet-CXR</a></p>
          <p><i class="fa fa-file-pdf-o fa-fw"></i><a href="../files/cv-minutti.pdf">CV</a></p>
        </div>
      </div><br>

    <!-- End Left Column -->
    </div>

    <!-- Right Column -->
    <div class="w3-twothird">

      <!-- Biography -->
      <div class="section-card">
        <div class="section-header">
          <i class="fa fa-user-o"></i>
          <h2>Biograf&iacute;a</h2>
        </div>
        <div class="section-body">
          <p>
            Soy investigador en inteligencia artificial y ciencia de datos. 
            Cuento con una licenciatura en Estadística por la Universidad Autónoma Chapingo, 
            una maestría en Matemáticas y un doctorado en Ciencias de la Computación por la 
            Universidad Nacional Autónoma de México, donde además realicé una estancia de 
            investigación en la Universidad de Waterloo, Canadá, a través del programa 
            Emerging Leaders in the Americas.
          </p>
          <p>
            Soy miembro del Sistema Nacional de Investigadores. Mi trabajo ha sido reconocido 
            a nivel nacional e internacional, incluyendo el segundo lugar a la mejor tesis 
            de maestría por la Asociación Mexicana de Estadística, el primer lugar en el 
            Best Paper Award de MICAI 2023 y el tercer lugar en el Premio AFIRME–UNAM 2024. 
            También he obtenido premios en competencias internacionales de ciencia de datos 
            e inteligencia artificial, como el primer lugar en la International Joint 
            Conference on Neural Networks (IJCNN 2025) y el segundo lugar en el Iberian 
            Language Evaluation Forum (IberLEF 2025).
          </p>
          <p>
            He realizado estancias posdoctorales tanto en el Instituto Politécnico Nacional 
            como en la Universidad Nacional Autónoma de México. Asimismo, he trabajado como 
            consultor en ciencia de datos y como asociado de investigación en iniciativas 
            colaborativas de inteligencia artificial.
          </p>
        </div>
      </div>

      <!-- Selected Publications -->
      <div class="section-card">
        <div class="section-header">
          <i class="fa fa-star-o"></i>
          <h2>Publicaciones Destacadas</h2>
        </div>

        <div class="pub-featured">
          <div class="pub-featured-text">
            <h5>Contaminaci&oacute;n del Aire, Estatus Socioecon&oacute;mico y Hospitalizaciones Evitables: Un An&aacute;lisis Multifac&eacute;tico</h5>
            <h6>Mathematical and Computational Applications</h6>
            <p>Este estudio investiga los efectos combinados de la contaminaci&oacute;n del aire y los factores socioecon&oacute;micos sobre la incidencia y gravedad de enfermedades, abordando vac&iacute;os en investigaciones previas que a menudo analizaban estos factores por separado. Utilizando datos de 86,170 hospitalizaciones en la Ciudad de M&eacute;xico (2015&ndash;2019), empleamos m&eacute;todos estad&iacute;sticos multivariados (ACP y an&aacute;lisis factorial) para construir medidas compuestas de estatus social y econ&oacute;mico y agrupar contaminantes correlacionados. Modelos de regresi&oacute;n log&iacute;stica y binomial negativa evaluaron sus asociaciones con el riesgo y frecuencia de hospitalizaci&oacute;n. Los resultados mostraron que el estatus econ&oacute;mico influy&oacute; significativamente en las complicaciones de diabetes, mientras que los factores sociales afectaron enfermedades relacionadas con la atenci&oacute;n prenatal y la hipertensi&oacute;n. El grupo <span style="white-space: nowrap;">PM<sub>10</sub>&ndash;PM<sub>2.5</sub>&ndash;CO</span> aument&oacute; la incidencia de asma, influenza y epilepsia, mientras que <span style="white-space: nowrap;">NO<sub>2</sub>&ndash;NO<sub>x</sub></span> impact&oacute; la gravedad de complicaciones de diabetes e influenza.</p>
          </div>
          <div class="pub-featured-images">
            <a href="https://www.mdpi.com/2297-8747/30/4/69"><img src="../files/diabetes.png" alt="An&aacute;lisis de hospitalizaciones por diabetes"></a>
            <a href="https://www.mdpi.com/2297-8747/30/4/69"><img src="../files/pca.png" alt="An&aacute;lisis ACP de contaminaci&oacute;n y factores socioecon&oacute;micos"></a>
          </div>
        </div>

        <div class="pub-featured">
          <div class="pub-featured-text">
            <h5>Mejora de la interpretabilidad y control de sesgos en modelos de aprendizaje profundo para an&aacute;lisis de im&aacute;genes m&eacute;dicas usando IA generativa</h5>
            <h6>Proceedings of SPIE</h6>
            <p>La explicabilidad y mitigaci&oacute;n de sesgos son aspectos cruciales de los modelos de aprendizaje profundo (DL) para el an&aacute;lisis de im&aacute;genes m&eacute;dicas. La IA generativa, particularmente los autoencoders, puede mejorar la explicabilidad analizando el espacio latente para identificar y controlar variables que contribuyen a sesgos. Al manipular el espacio latente, los sesgos pueden mitigarse en la capa de clasificaci&oacute;n. Adem&aacute;s, el espacio latente puede visualizarse para proporcionar una comprensi&oacute;n m&aacute;s intuitiva del proceso de toma de decisiones del modelo. En nuestro trabajo, demostramos c&oacute;mo el enfoque propuesto mejora la explicabilidad del proceso de toma de decisiones, superando las capacidades de m&eacute;todos tradicionales como Grad-Cam. Nuestro enfoque identifica y mitiga sesgos de manera directa, sin necesidad de reentrenamiento del modelo o modificaci&oacute;n del conjunto de datos.</p>
          </div>
          <div class="pub-featured-images">
            <a href="https://doi.org/10.1117/12.3022263"><img src="../files/brain_vae_1.png" alt="Visualizaci&oacute;n de an&aacute;lisis cerebral VAE"></a>
            <a href="https://doi.org/10.1117/12.3022263"><img src="../files/brain_vae_2.png" alt="Visualizaci&oacute;n del espacio latente cerebral VAE"></a>
          </div>
        </div>

        <div class="pub-featured">
          <div class="pub-featured-text">
            <h5>PumaMedNet-CXR: Una Inteligencia Artificial Generativa Explicable para el An&aacute;lisis y Clasificaci&oacute;n de Im&aacute;genes de Rayos X de T&oacute;rax</h5>
            <h6>Lecture Notes in Computer Science</h6>
            <p>En este art&iacute;culo presentamos PumaMedNet-CXR, una IA generativa dise&ntilde;ada para la clasificaci&oacute;n de im&aacute;genes m&eacute;dicas, con &eacute;nfasis espec&iacute;fico en im&aacute;genes de rayos X de t&oacute;rax (CXR). El modelo corrige eficazmente defectos comunes en im&aacute;genes CXR, ofrece mejor explicabilidad, permitiendo una comprensi&oacute;n m&aacute;s profunda de su proceso de toma de decisiones. Al analizar su espacio latente, podemos identificar y mitigar sesgos, asegurando un modelo m&aacute;s confiable y transparente. Notablemente, PumaMedNet-CXR logra un rendimiento comparable al de modelos preentrenados m&aacute;s grandes mediante aprendizaje por transferencia, convirti&eacute;ndolo en una herramienta prometedora para el an&aacute;lisis de im&aacute;genes m&eacute;dicas.</p>
          </div>
          <div class="pub-featured-images">
            <a href="https://link.springer.com/chapter/10.1007/978-3-031-47640-2_18"><img src="https://media.springernature.com/full/springer-static/image/chp%3A10.1007%2F978-3-031-47640-2_18/MediaObjects/556477_1_En_18_Fig1_HTML.png" alt="Arquitectura de PumaMedNet-CXR"></a>
            <a href="https://link.springer.com/chapter/10.1007/978-3-031-47640-2_18"><img src="https://media.springernature.com/full/springer-static/image/chp%3A10.1007%2F978-3-031-47640-2_18/MediaObjects/556477_1_En_18_Fig6_HTML.png" alt="Resultados de PumaMedNet-CXR"></a>
          </div>
        </div>

        <div class="pub-featured">
          <div class="pub-featured-text">
            <h5>Exploraci&oacute;n de efectos no lineales de la contaminaci&oacute;n del aire en admisiones hospitalarias por enfermedad usando m&aacute;quinas de gradient boosting</h5>
            <h6>IEEE</h6>
            <p>La contaminaci&oacute;n del aire se ha vinculado con mortalidad prematura y reducci&oacute;n de la esperanza de vida, con efectos agudos y cr&oacute;nicos en la salud humana. Estos efectos pueden ser dif&iacute;ciles de medir debido a posibles interacciones y relaciones no lineales con otras variables como edad, peso, sexo y estatus socioecon&oacute;mico. Las relaciones multidimensionales son dif&iacute;ciles de modelar usando m&eacute;todos estad&iacute;sticos convencionales. Sin embargo, las t&eacute;cnicas modernas de aprendizaje autom&aacute;tico han sido bastante exitosas en este dominio. En este estudio, se utilizan &aacute;rboles de regresi&oacute;n de gradient boosting para predecir la severidad/mortalidad de las principales causas de hospitalizaci&oacute;n en la Ciudad de M&eacute;xico para 91,964 pacientes durante los a&ntilde;os 2015&ndash;2020 para medir el impacto de diferentes contaminantes del aire.</p>
          </div>
          <div class="pub-featured-images">
            <a href="https://doi.org/10.1109/CCE56709.2022.9976027"><img src="../files/minut4-p6-minut-large.gif" alt="Visualizaci&oacute;n de efectos no lineales de contaminaci&oacute;n"></a>
            <a href="https://doi.org/10.1109/CCE56709.2022.9976027"><img src="../files/minut5-p6-minut-large.gif" alt="Resultados de gradient boosting para contaminaci&oacute;n"></a>
          </div>
        </div>

        <div class="pub-featured">
          <div class="pub-featured-text">
            <h5>Un Modelo H&iacute;brido para la Predicci&oacute;n de Concentraciones de Contaminantes del Aire, Basado en T&eacute;cnicas Estad&iacute;sticas y de Aprendizaje Autom&aacute;tico</h5>
            <h6>Lecture Notes in Computer Science</h6>
            <p>En las grandes ciudades, la salud de los habitantes y las concentraciones de part&iacute;culas menores a 10 y 2.5 &mu;m as&iacute; como el ozono est&aacute;n relacionados, haciendo &uacute;til su predicci&oacute;n para el gobierno y los ciudadanos. La Ciudad de M&eacute;xico cuenta con un sistema de pron&oacute;stico de calidad del aire, que presenta un pron&oacute;stico por contaminante a nivel horario y por zona geogr&aacute;fica, pero solo es v&aacute;lido para las pr&oacute;ximas 24 horas.</p>
            <p>Para generar predicciones a un plazo m&aacute;s largo, se necesitan m&eacute;todos sofisticados, pero t&eacute;cnicas altamente automatizadas como el aprendizaje profundo requieren una gran cantidad de datos, que no est&aacute;n disponibles para este problema. Por lo tanto, se crea un conjunto de variables predictoras para alimentar y probar diferentes m&eacute;todos de Aprendizaje Autom&aacute;tico (AA), y determinar qu&eacute; caracter&iacute;sticas de estos m&eacute;todos son esenciales para la predicci&oacute;n de diferentes concentraciones de contaminantes.</p>
            <p>En este trabajo presentamos un modelo h&iacute;brido de predicci&oacute;n utilizando diferentes m&eacute;todos estad&iacute;sticos y t&eacute;cnicas de AA, que permiten estimar la concentraci&oacute;n de los tres principales contaminantes del aire de la Ciudad de M&eacute;xico con dos semanas de anticipaci&oacute;n. Se presentan y comparan los resultados de los diferentes modelos, siendo el modelo h&iacute;brido el que mejor predice los casos extremos.</p>
          </div>
          <div class="pub-featured-images">
            <a href="https://link.springer.com/chapter/10.1007/978-3-030-89820-5_21"><img src="https://media.springernature.com/full/springer-static/image/chp%3A10.1007%2F978-3-030-89820-5_21/MediaObjects/523088_1_En_21_Fig5_HTML.png?as=webp" alt="Resultados del modelo de predicci&oacute;n de contaminantes"></a>
            <a href="https://link.springer.com/chapter/10.1007/978-3-030-89820-5_21"><img src="https://media.springernature.com/full/springer-static/image/chp%3A10.1007%2F978-3-030-89820-5_21/MediaObjects/523088_1_En_21_Fig1_HTML.png" alt="Arquitectura del modelo h&iacute;brido"></a>
            <a href="https://link.springer.com/chapter/10.1007/978-3-030-89820-5_21"><img src="https://media.springernature.com/full/springer-static/image/chp%3A10.1007%2F978-3-030-89820-5_21/MediaObjects/523088_1_En_21_Fig3_HTML.png?as=webp" alt="Predicciones de concentraci&oacute;n de contaminantes"></a>
          </div>
        </div>
      </div>

      <!-- Publications -->
      <div class="section-card">
        <div class="section-header">
          <i class="fa fa-file-text-o"></i>
          <h2>Publicaciones</h2>
        </div>
        <div class="pub-list">
          <ol>
            <li class="pub-entry">
              "Forecasting an Emerging Market Stock Index: a Comparative Study of Classical and Deep Learning Models". Lorenzo-Landa, G., <b>Minutti-Martinez, C.</b>. <br>International Conference in Software Engineering Research and Innovation, (2025). doi: <a href="https://doi.org/10.1109/CONISOFT66928.2025.00049">10.1109/CONISOFT66928.2025.00049</a>.
            </li>
            <li class="pub-entry">
              "Multitask Analysis of Spanish Travel Reviews: Sentiment, Destination, and Topic Classification with RoBERTa and LLaMA Ensembles". <b>Minutti-Martinez, C.</b>, Escalante-Ram&iacute;rez, B., Olveres-Montiel, J. <br>CEUR Workshop Proceedings, (2025).
            </li>
            <li class="pub-entry">
              "Cyclo-VGAE: Dual-Mechanism Approach to GNN Robustness Against Noisy Labels". <b>Minutti-Martinez, C.</b>, Escalante-Ram&iacute;rez, B., Olveres-Montiel, J. <br>International Joint Conference on Neural Networks (IJCNN), Roma, Italia, IEEE, pp. 1-8, (2025). doi: <a href="https://doi.org/10.1109/IJCNN64981.2025.11227407">10.1109/IJCNN64981.2025.11227407</a>.
            </li>
            <li class="pub-entry">
              "Air Pollution, Socioeconomic Status, and Avoidable Hospitalizations: A Multifaceted Analysis". <b>Minutti-Martinez, C.</b>, Mata-Rivera, M. F., Arellano-Vazquez, M., Escalante-Ram&iacute;rez, B., &amp; Olveres, J. <br><i>Mathematical and Computational Applications</i>, 30(4), 69. (2025). <a href="https://doi.org/10.3390/mca30040069">doi:10.3390/mca30040069</a>
            </li>
            <li class="pub-entry">
              "Dynamic Wind Condition Detection in Baja California, Mexico: A Machine Learning Approach for Improved Wind Management". Arellano-Vazquez, M., Zamora-Machado, M., Robles P&eacute;rez, M., <b>Minutti-Martinez, C.</b>, Jaramillo Salgado, M. O. <br><i>IEEE Latin America Transactions.</i>, 23(5), 387&ndash;396. (2025).
            </li>
            <li class="pub-entry">
              "Air Pollution, Socioeconomic Status, and Avoidable Hospitalizations in Mexico City: A Multifaceted Analysis". <b>Minutti-Martinez, C.</b>, Mata-Rivera, M., Arellano-Vazquez, M., Escalante-Ram&iacute;rez, B., Olveres, J. <br><i>Lecture Notes in Computer Science. Springer, Cham.</i> (2025).
            </li>
            <li class="pub-entry">
              "Unraveling the Complex Interplay Between Socioeconomic Status, Air Pollution, and Heart Disease Hospitalizations in an Urban Population". <b>Minutti, C.</b> <br><i>International Conference on Electrical Engineering, Computing Science and Automatic Control (CCE)</i>. (2024).
            </li>
            <li class="pub-entry">
              "A comprehensive methodology for performing Continued Process Verification". Carrillo, R., <b>Minutti, C.</b>, Lagunes, P. <br><i>IEEE 37th International Symposium on Computer-Based Medical Systems</i>. (2024).
            </li>
            <li class="pub-entry">
              "Enhancing interpretability and bias control in deep learning models for medical image analysis using generative AI". <b>Minutti-Martinez, C.</b>, Escalante-Ram&iacute;rez, B., Olveres-Montiel, J. <br><i>Proceedings of SPIE</i>. (2024).
            </li>
            <li class="pub-entry">
              "PumaMedNet-CXR: An Explainable Generative Artificial Intelligence for the Analysis and Classification of Chest X-Ray Images". <b>Minutti-Martinez, C.</b>, Escalante-Ram&iacute;rez, B., Olveres-Montiel, J. <br><i>Lecture Notes in Computer Science</i>. (2023).
            </li>
            <li class="pub-entry">
              "Exploring nonlinear effects of air pollution on hospital admissions by disease using gradient boosting machines". <b>Minutti-Martinez, C.</b>, Galindo, A., Valdez-Gardu&ntilde;o, L. F., Mata-Rivera, M. F. <br><i>19th International Conference on Electrical Engineering, Computing Science and Automatic Control. IEEE.</i> (2022).
            </li>
            <li class="pub-entry">
              "A Hybrid Model for the Prediction of Air Pollutants Concentration, Based on Statistical and Machine Learning Techniques". <b>Minutti-Martinez, C.</b>, Arellano-V&aacute;zquez, M., Zamora-Machado, M. <br><i>Lecture Notes in Computer Science</i>. (2021).
            </li>
            <li class="pub-entry">
              "A New Inverse Modeling Approach for Hydraulic Conductivity Estimation Based on Gaussian Mixtures". <b>Minutti, C.</b>, Illman, W. A., Gomez, S. <br><i>Water Resources Research</i>. (2020).
            </li>
            <li class="pub-entry">
              "Automated characterization and prediction of wind conditions using gaussian mixtures". Arellano-V&aacute;zquez, M., <b>Minutti-Martinez, C.</b>, Zamora-Machado, M. <br><i>Lecture Notes in Computer Science</i>. (2020).
            </li>
            <li class="pub-entry">
              "An algorithm for hydraulic tomography based on a mixture model". <b>Minutti, C.</b>, Illman, W. A., Gomez, S. <br><i>Lecture Notes in Computer Science</i>. (2019).
            </li>
            <li class="pub-entry">
              "A machine-learning approach for noise reduction in parameter estimation inverse problems, applied to characterization of oil reservoirs". <b>Minutti, C.</b>, Gomez, S., Ramos, G. <br><i>Journal of Physics: Conference Series</i>. 1047 (1), 012010. (2018).
            </li>
            <li class="pub-entry">
              "A stable computation of log-derivatives from noisy drawdown data". Ramos, G., Carrera, J., G&oacute;mez, S., <b>Minutti, C.</b>, Camacho, R. <br><i>Water Resources Research</i> 53 (9), 7904-7916. (2017).
            </li>
            <li class="pub-entry">
              "Robust Characterization of Naturally Fractured Carbonate Reservoirs Through Sensitivity Analysis and Noise Propagation Reduction". <b>Minutti, C.</b>, Ramos, G., Gomez, S., Camacho, R., V&aacute;zquez, M., Castillo, N. <br><i>SPE Latin America and Caribbean Heavy and Extra Heavy Oil Conference</i>. (2016).
            </li>
            <li class="pub-entry">
              "Well-Testing Characterization of Heavy-Oil Naturally Fractured Vuggy Reservoirs". Camacho Velazquez, R., Gomez, S., Vasquez-Cruz, M. A., Fuenleal, N. A., Castillo, T., Ramos, G., <b>Minutti, C.</b>, Mesejo, A., Fuentes-Cruz, G. <br><i>SPE Heavy and Extra Heavy Oil Conference: Latin America</i> (2014).
            </li>
            <li class="pub-entry">
              "Avances en la caracterizaci&oacute;n integral de un yacimiento naturalmente fracturado vugular, el caso Ayatsil-Tekel". Camacho Vel&aacute;zquez, R., Fuenleal Mart&iacute;nez, N., Castillo Rodr&iacute;guez, T., G&oacute;mez G&oacute;mez, S., Ramos, G., <b>Minutti Mart&iacute;nez, C.</b>, V&aacute;squez Cruz, M., Mesejo, A., Fuentes Cruz, G. <br><i>Ingenier&iacute;a petrolera</i>. 54 (10), 583-601 (2014).
            </li>
          </ol>
        </div>
      </div>

      <!-- International Conferences -->
      <div class="section-card">
        <div class="section-header">
          <i class="fa fa-bar-chart"></i>
          <h2>Conferencias Internacionales</h2>
        </div>
        <div class="pub-list">
          <ol>
            <li class="pub-entry">
              "Cyclo-VGAE: Dual-Mechanism Approach to GNN Robustness Against Noisy Labels". <br><i>International Joint Conference on Neural Networks 2025. Roma, Italia</i>. (2025).
            </li>
            <li class="pub-entry">
              "Unraveling the Complex Interplay Between Socioeconomic Status, Air Pollution, and Heart Disease Hospitalizations in an Urban Population". <br><i>2024 21st International Conference on Electrical Engineering, Computing Science and Automatic Control (CCE). Cinvestav, Ciudad de M&eacute;xico</i>. (2024).
            </li>
            <li class="pub-entry">
              "Air Pollution, Socioeconomic Status, and Avoidable Hospitalizations in Mexico City: A Multifaceted Analysis". <br><i>6th Workshop on New Trends in Computational Intelligence and Applications. INAOE, Puebla, M&eacute;xico</i>. (2024).
            </li>
            <li class="pub-entry">
              "Unraveling the Complex Interplay Between Socioeconomic Status, Air Pollution, and Heart Disease Hospitalizations in an Urban Population". <br><i>21st International Conference on Electrical Engineering, Computing Science and Automatic Control (CCE). Ciudad de M&eacute;xico, M&eacute;xico.</i> (2024).
            </li>
            <li class="pub-entry">
              "Enhancing interpretability and bias control in deep learning models for medical image analysis using generative AI". <br><i>SPIE Photonics Europe 2024. Estrasburgo, Francia. 7-11 de abril.</i> (2024).
            </li>
            <li class="pub-entry">
              "PumaMedNet-CXR: An Explainable Denoising Autoencoder for the Analysis and Classification of Chest X-Ray Images". <br><i>22&ordf; Conferencia Internacional Mexicana de Inteligencia Artificial, 13-18 de noviembre, IIMAS-UNAM (UAEY) - UADY, M&eacute;rida, Yucat&aacute;n, M&eacute;xico.</i> (2023).
            </li>
            <li class="pub-entry">
              "Exploring nonlinear effects of air pollution on hospital admissions by disease using gradient boosting machines". <br><i>19th International Conference on Electrical Engineering, Computing Science and Automatic Control (CCE). Ciudad de M&eacute;xico, M&eacute;xico.</i> (2022).
            </li>
            <li class="pub-entry">
              "Automated Prediction of Air Pollutant Concentrations in Mexico City, Using Artificial Intelligence Methods". <br><i>20th Mexican International Conference on Artificial Intelligence. 25-30 de octubre, Ciudad de M&eacute;xico, M&eacute;xico.</i> (2021).
            </li>
            <li class="pub-entry">
              "An algorithm to perform hydraulic tomography based on a mixture model". <br><i>International Conference on Computational Science. 12-14 de junio, Faro, Algarve, Portugal.</i> (2019).
            </li>
            <li class="pub-entry">
              "An approach for noise reduction in inverse problems, applied to well-test data". <br><i>9th International Conference on Inverse Problems in Engineering. 23-26 de mayo, Universidad de Waterloo, ON, Canad&aacute;.</i> (2017).
            </li>
            <li class="pub-entry">
              "A Methodology for the Characterization of Naturally Fractured-Vuggy Carbonate Reservoirs Using Statistical Methods". <br><i>Eighth International Conference "Inverse Problems: Modeling and Simulation". 23-28 de mayo, &Ouml;l&uuml;deniz, Fethiye, Turqu&iacute;a</i>. (2016).
            </li>
          </ol>
        </div>
      </div>

      <!-- Awards and Distinctions -->
      <div class="section-card">
        <div class="section-header">
          <i class="fa fa-trophy"></i>
          <h2>Premios y Distinciones</h2>
        </div>
        <div class="awards-list">
          <ul>
            <li class="award-item">
              Top 10 en el programa &ldquo;Acelerando M&eacute;xico con Inteligencia Artificial&rdquo; de Intel, edici&oacute;n 2025. (2025).
            </li>
            <li class="award-item">
              2&ordm; Lugar en la competencia de Procesamiento de Lenguaje Natural (PLN) "Researching Sentiment Evaluation in Text for Mexican Magical Towns" (Rest-Mex 2025) en el Iberian Languages Evaluation Forum (IberLEF) 2025.
            </li>
            <li class="award-item">
              1er Lugar en la competencia "Learning with Noisy Graph Labels" en la International Joint Conference on Neural Networks 2025 de la International Neural Network Society (INNS).
            </li>
            <li class="award-item">
              3er Lugar en la categor&iacute;a de investigaci&oacute;n del premio AFIRME-FUNAM, que promueve y reconoce la investigaci&oacute;n cient&iacute;fica en las &aacute;reas de Ciencias F&iacute;sico-Matem&aacute;ticas e Ingenier&iacute;a, a trav&eacute;s de la Universidad Nacional Aut&oacute;noma de M&eacute;xico y el Grupo Financiero AFIRME. (2024).
            </li>
            <li class="award-item">
              Becario del programa INFOTEC-HUAWEI AI 1000 Talent Development. De 1000 participantes, el programa AI 1000 premia a los 100 mejores resultados de certificaci&oacute;n Huawei HCIA-AI con un programa de capacitaci&oacute;n de 2 semanas en IA en las instalaciones de Huawei en Hangzhou, China. (2024).
            </li>
            <li class="award-item">
              1er Lugar Premio al Mejor Art&iacute;culo en la 22&ordf; Conferencia Internacional Mexicana de Inteligencia Artificial por la Sociedad Mexicana de Inteligencia Artificial. (2023).
            </li>
            <li class="award-item">
              Miembro del Sistema Nacional de Investigadores (SNI). &Aacute;rea Interdisciplinaria. (2023).
            </li>
            <li class="award-item">
              Clasificado en el top 3% (Medalla de Plata) de la competencia de Ciencia de Datos / IA "Google Smartphone Decimeter Challenge", con 810 equipos y 985 competidores de todo el mundo. (2021).
            </li>
            <li class="award-item">
              Becario del programa Emerging Leaders in the Americas para oportunidades de intercambio a corto plazo para estudio o investigaci&oacute;n, en Canad&aacute;. (2017).
            </li>
            <li class="award-item">
              Segundo lugar por la mejor tesis de maestr&iacute;a en estad&iacute;stica. Premio nacional de la Asociaci&oacute;n Mexicana de Estad&iacute;stica (AME), Premio Francisco Aranda-Ordaz. (2016).
            </li>
          </ul>
        </div>
      </div>

    <!-- End Right Column -->
    </div>

  <!-- End Grid -->
  </div>

<!-- End Page Container -->
</div>

<footer class="site-footer">
  <p>Copyright &copy; Carlos Minutti</p>
  <p>&Uacute;ltima actualizaci&oacute;n: 02/2026</p>
  <div class="footer-links">
    <a href="https://scholar.google.com/citations?user=wPweiiEAAAAJ" title="Google Scholar"><i class="fa fa-graduation-cap"></i></a>
    <a href="https://www.linkedin.com/in/carlos-minutti/" title="LinkedIn"><i class="fa fa-linkedin"></i></a>
    <a href="https://github.com/cminuttim" title="GitHub"><i class="fa fa-github"></i></a>
    <a href="https://data-fusionlab.com" title="Consulting"><i class="fa fa-globe"></i></a>
  </div>
</footer>

</body>
</html>
